In [2]:
import pandas as pd
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
price = pd.Series([10000, 9000, 8000])
# 변수명을 그냥 적어도 출력됨 단, 하단의 1개만 출력
# menu
# price

# 동시출력
# display(menu,price)

# 각각출력
# print(menu)
# print(price)

In [11]:
df_from_series = pd.DataFrame({
    '메뉴': menu,
    '가격': price
})
df_from_series

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [3]:
df = pd.DataFrame({
    '메뉴': ['비빔밥', '김치찌개', '된장찌개'],
    '가격': [10000, 9000, 8000],
    '원산지': ['국내산', '국내산', '국내산']
})
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [5]:
menu_series = df['메뉴']     # 타입: pandas.Series
menu_series
# type(menu_series)

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object

In [6]:
menu_df = df[['메뉴']]       # 타입: pandas.DataFrame
menu_df
# type(menu_df)

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [7]:
menu_price_df = df[['메뉴', '가격']]
menu_price_df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [8]:
cols = ['메뉴', '가격']
menu_price_df2 = df[cols]
menu_price_df2

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [9]:
print('df          : ', type(df))
print("df['가격']   : ", type(df['가격']))     # Series
print("df[['가격']] : ", type(df[['가격']]))   # DataFrame

df          :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [57]:
# 첫 번째 행(인덱스 0) 전체
row0 = df.loc[:0]
row0
# 인덱스 0~1 범위(끝 포함)
# rows_0_to_1 = df.loc[:1]
# rows_0_to_1
# 조건식: 가격이 9000 이상인 행
# rows_price_ge_9000 = df.loc[df['가격'] >= 9000, ['메뉴', '가격']]
# rows_price_ge_9000

    메뉴     가격  원산지
0  비빔밥  10000  국내산

In [54]:
# 첫 번째 행(정수 위치 0)
row0_iloc = df.iloc[:1]
row0_iloc
# 첫 2행(0,1)과 앞의 2개 컬럼(0,1)
# sub_iloc = df.iloc[2:3, 1:2]
# sub_iloc

    메뉴     가격  원산지
0  비빔밥  10000  국내산

In [59]:
# 예: 10% 할인 가격 컬럼 추가
df['할인가'] = (df['가격'] * 0.9).astype(int)
df

     메뉴     가격  원산지   할인가
0   비빔밥  10000  국내산  9000
1  김치찌개   9000  국내산  8100
2  된장찌개   8000  국내산  7200

In [63]:
# 예: '김치찌개' 가격 9500으로 변경
df.loc[df['메뉴'] == '김치찌개', '가격'] = 9500
df

     메뉴     가격  원산지   할인가
0   비빔밥  10000  국내산  9000
1  김치찌개   9500  국내산  8100
2  된장찌개   8000  국내산  7200

In [64]:
# 예: '할인가' 컬럼 삭제
# df.drop(columns=['할인가']) <-재정의 하지않으면 반영 안됨
df = df.drop(columns=['할인가'])
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9500  국내산
2  된장찌개   8000  국내산

In [67]:
# 다음 과일 이름으로 pd.Series를 만들어 fruits 변수에 저장하시오: ['사과', '바나나', '포도']
fruits = pd.Series(['사과', '바나나', '포도'])
fruits

0     사과
1    바나나
2     포도
dtype: object

In [140]:
# 다음 데이터를 이용해 아래와 같은 컬럼을 가진 df를 생성하시오.

# 컬럼: 상품, 가격, 재고
# 데이터:
# 상품: ['키보드', '마우스', '모니터']
# 가격: [30000, 15000, 200000]
# 재고: [10, 25, 7]
df = pd.DataFrame({
    '상품': ['키보드', '마우스', '모니터'],
    '가격': [30000, 15000, 200000],
    '재고': [10, 25, 7]
})
df

    상품      가격  재고
0  키보드   30000  10
1  마우스   15000  25
2  모니터  200000   7

In [81]:
# 문제 3) 단일 컬럼 선택 (Series vs DataFrame)
# 문제 2에서 만든 df로부터 상품 컬럼을 (1) Series로, (2) DataFrame으로 각각 선택해 prod_s, prod_df에 저장하시오.
prod_s = df[:3]
prod_df = df[['상품','가격','재고']]

In [82]:
# 문제 4) 여러 컬럼 선택
# 문제 2의 df에서 상품과 가격 컬럼만 선택하여 price_view 변수에 저장하시오.
price_view = df[['상품','가격']]
price_view

    상품      가격
0  키보드   30000
1  마우스   15000
2  모니터  200000

In [92]:
# 문제 2의 df에서 가격이 20000 이상인 행만 loc로 필터링하여 expensive에 저장하시오.
# 단, 컬럼은 상품, 가격만 선택하시오.
expensive = df.loc[df['가격']>=20000, ['상품','가격']]
expensive

    상품      가격
0  키보드   30000
2  모니터  200000

In [100]:
# 문제 2의 df에서 상품이 '마우스'인 행의 가격을 17000으로 수정하시오.
df.loc[df['상품'] == '마우스', '가격'] = 17000
df

    상품      가격  재고
0  키보드   30000  10
1  마우스   17000  25
2  모니터  200000   7

In [109]:
# 문제 2의 df에서 첫 2행과 앞의 2개 컬럼만 iloc으로 선택해 sub_iloc에 저장하시오.
sub_iloc = df.iloc[:2, :2]
sub_iloc

    상품     가격
0  키보드  30000
1  마우스  15000

In [139]:
# 문제 2의 df에 **부가세 포함 가격(10% 가산)**을 정수형으로 계산하여 부가세포함가 컬럼으로 추가하시오.
df['부가세포함가'] = (df['가격']*1.1).astype(int)
df

    상품      가격  재고  부가세포함가
0  키보드   30000  10   33000
1  마우스   15000  25   16500
2  모니터  200000   7  220000

In [119]:
# 문제 2의 df를 가격 기준 내림차순으로 정렬한 결과를 df_sorted에 저장하시오.
df_sorted = df.sort_values(by='가격',ascending=False)
df_sorted

    상품      가격  재고
2  모니터  200000   7
0  키보드   30000  10
1  마우스   15000  25

In [137]:
# 문제 2의 df에서 컬럼명을 다음과 같이 변경한 새로운 DataFrame df_en을 생성하시오.
# 상품 → product
# 가격 → price
# 재고 → stock
df_en = df.rename(columns={'상품':'product','가격':'price','재고':'stock'})
df_en

  product   price  stock
0     키보드   30000     10
1     마우스   15000     25
2     모니터  200000      7

In [ ]:
# 아래와 같이 인덱스 라벨이 0, 1, 2, 3인 df2가 있다고 할 때,
# loc로 0부터 2까지 행을 선택하여 part_loc에 저장하시오. (loc는 끝 포함 규칙을 사용함)